tests/fixtures/webhooks/billing_statement.created.json

{
    "id": "evt_yYCzrb76foeeZAQhu9nX3bnzE9MxNfW4",
    "resource": "event",
    "type": "billing_statement.created",
    "data": {
        "id": "bstm_jbvrBvJSTsyCDsYTMpyM3o8hEGdeX4tC",
        "resource": "billing_statement",
        "amount": 0,
        "currency": "PHP",
        "customer_id": "cus_vhFA73Qu3M6GQwhRwEVgAX9aFZUAxeYD",
        "description": "Test billing statement",
        "due_at": 0,
        "finalized_at": 0,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "UAEONUMZ-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_jbvrBvJSTsyCDsYTMpyM3o8hEGdeX4tC_secret_S1MNRpTH2MMvLcoBNu6KTpevmogbrfrU2YLMxZ47uT6wpBrMTo",
        "line_items": [],
        "livemode": false,
        "merchant_id": "merc_XNNXbTz2n4UAigUwdPRdPqYUk61vvBDW",
        "statement_descriptor": null,
        "status": "draft",
        "metadata": null,
        "customer": {
            "id": "cus_vhFA73Qu3M6GQwhRwEVgAX9aFZUAxeYD",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": null,
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773752596,
        "updated_at": 1773752596
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {},
    "created_at": 1773752596,
    "updated_at": 1773752596
}
